{
  "task_type": "CAUSAL_LM",
  "peft_type": "LORA",
  "auto_mapping": null,
  "base_model_name_or_path": "./Mistral-7B-v0.1",
  "revision": null,
  "inference_mode": false,
  "r": 16,
  "target_modules": [
    "q_proj",
    "up_proj",
    "gate_proj",
    "v_proj",
    "k_proj",
    "down_proj",
    "o_proj"
  ],
  "exclude_modules": null,
  "lora_alpha": 32,
  "lora_dropout": 0.1,
  "fan_in_fan_out": false,
  "bias": "none",
  "use_rslora": false,
  "modules_to_save": null,
  "init_lora_weights": true,
  "layers_to_transform": null,
  "layers_pattern": null,
  "rank_pattern": {},
  "alpha_pattern": {},
  "megatron_config": null,
  "megatron_core": "megatron.core",
  "trainable_token_indices": null,
  "loftq_config": {},
  "eva_config": null,
  "corda_config": null,
  "use_dora": false,
  "layer_replication": null,
  "runtime_config": 